{

  "Language": {
    "1": "Change Language"
  },
  "ChangeLang": {
    "1": "en"
  },
  "Message": {
    "1": "हमें लिखें",
    "2": "आपका नाम",
    "3": "तुम्हारा ईमेल",
    "4": "आपका सन्देश",
    "5": "भेजें"
  },
  "navigation":{
    "1":"वीडियो",
    "2":"प्रयोगों",
    "3":"प्रश्नोत्तरी",
    "4":"प्रयोगशाला"
  },
  "quiz1":{
    "topic":"छद्म यादृच्छिक संख्या जनरेटर",
    "Q1":{
      "ques": "धारा सिफर के मामले में निम्नलिखित में से किसका उपयोग नहीं किया जा सकता है?",
      "a":"TRNGs",
      "b":"PRNGs",
      "c":"PRFs",
      "d":"उल्लेखित सभी"
    },
    "Q2":{
      "ques": "एक धारा सिफर कुंजी आमतौर पर आकार ___ या 128 बिट्स होती है।",
      "a":"५६",
      "b":"६४",
      "c":"५४",
      "d":"४८"
    },
    "Q3":{
      "ques": "निम्नलिखित में से किसमें सबसे कम बिटरेट है?",
      "a":"PRF",
      "b":"TRNG",
      "c":"PRNG",
      "d":"सभी में एक ही बिटरेट है"
    },
    "Q4":{
      "ques": "RC4 का निर्माण यादृच्छिक बिट्स यानी PRNG के रूप में कार्य करने के लिए किया गया था।",
      "a":"सत्य",
      "b":"असत्य"
    },
    "Q5":{
      "ques": "मौरर का सार्वभौमिक सांख्यिकीय परीक्षण है",
      "a":"यह निर्धारित करने के लिए एक परीक्षण कि क्या विभिन्न लंबाई के लोगों और शून्य के रनों की संख्या अपेक्षित है",
      "b":"यह पता लगाने के लिए एक परीक्षण कि क्या जानकारी के नुकसान के बिना कोई अनुक्रम काफी संकुचित हो सकता है",
      "c":"यह निर्धारित करने के लिए एक परीक्षण कि क्या एक क्रम में लोगों और शून्य की संख्या लगभग सही मायने में यादृच्छिक आउटपुट के समान है",
      "d":"1s और 0s में समानता की जाँच के लिए एक परीक्षण"
    },
    "Q6":{
      "ques": "हम बिट्स अनुक्रम के किसी भी पिछले ज्ञान से बीज को निर्धारित करने में सक्षम नहीं होना चाहिए। यह पिछड़ी अप्रत्याशितता की संपत्ति है।",
      "a":"सत्य",
      "b":"असत्य"
    },
    "Q7":{
      "ques": "फॉरवर्ड अनप्रेडिक्टेबिलिटी एक संपत्ति है जब बीज अज्ञात है, और अगला आउटपुट बिट अनुक्रम है अप्रत्याशित होना चाहिए।",
      "a":"सत्य",
      "b":"असत्य"
    },
    "Q8":{
      "ques": "एक बड़ी संख्या एन के लिए एक प्रमुख संख्या होने के लिए एक नियम",
      "a":"N / 2 से कम हर पूर्णांक द्वारा N को विभाजित करके",
      "b":"N को मूल (N) से कम हर विषम पूर्णांक के साथ विभाजित करके",
      "c":"N को मूल (N) से कम हर पूर्णांक से विभाजित करके",
      "d":"N / 2 से कम हर पूर्णांक द्वारा N को विभाजित करके"
    },
    "Q9":{
      "ques": "वह गुण कि एक छद्म यादृच्छिक संख्या अनुक्रम में समान रूप से 1s और 0s की संभावना संख्या होनी चाहिए",
      "a":"अनुमापकता",
      "b":"एकरूपता",
      "c":"स्थिरता",
      "d":"अविरोध"
    },
    "Q10":{
      "ques": "वह गुण जिसे किसी निकाले जाने की प्रक्रिया को यादृच्छिकता के लिए परीक्षण पास करना चाहिए",
      "a":"अनुमापकता",
      "b":"एकरूपता",
      "c":"स्थिरता",
      "d":"अविरोध"
    }
  }

}
